Repository: jerkerolofsson/testbucket
Catalog: src/TestBucket/Localization/SettingStrings.*.resx
Languages: de_de, fr_fr, ja_jp, pt_br, sv_se, zh_cn

# prefer-text-to-icons-description
source: Uses text instead of icons in the user interface in some locations
de_de: Verwendet Text anstelle von Symbolen in der Benutzeroberfläche an einigen Stellen
fr_fr: Utilise du texte au lieu d'icônes dans l'interface utilisateur à certains endroits
ja_jp: 一部の場所のユーザーインターフェイスのアイコンの代わりにテキストを使用します
pt_br: Usa texto em vez de ícones na interface do usuário em alguns locais
sv_se: Använder text istället för ikoner i användargränssnittet på vissa platser
zh_cn: 在某些位置使用文本而不是用户界面中的图标

source: Profile
de_de: Profil
fr_fr: Profil
ja_jp: プロフィール
pt_br: Perfil
sv_se: Profil
zh_cn: 轮廓

source: Profile image
de_de: Profilbild
fr_fr: Image de profil
ja_jp: プロファイル画像
pt_br: Imagem do perfil
sv_se: Profilbild
zh_cn: 个人资料图像

source: Reduced motion
de_de: Reduzierte Bewegung
fr_fr: Mouvement réduit
ja_jp: モーションの減少
pt_br: Movimento reduzido
sv_se: Reducerad rörelse
zh_cn: 减少运动

# reduced-motion-description
source: Reduces transitions and animations
de_de: Reduziert Übergänge und Animationen
fr_fr: Réduit les transitions et les animations
ja_jp: 遷移とアニメーションを削減します
pt_br: Reduz transições e animações
sv_se: Minskar övergångar och animationer
zh_cn: 减少过渡和动画

source: Remove icon
de_de: Symbol entfernen
fr_fr: Supprimer l'icône
ja_jp: アイコンを削除します
pt_br: Remova o ícone
sv_se: Ta bort ikonen
zh_cn: 删除图标

source: Search settings..
de_de: Sucheinstellungen ..
fr_fr: Paramètres de recherche ..
ja_jp: 検索設定..
pt_br: Configurações de pesquisa ..
sv_se: Sökinställningar ..
zh_cn: 搜索设置..

source: Server
fr_fr: Serveur
ja_jp: サーバ
pt_br: Servidor
sv_se: Servern
zh_cn: 服务器

source: Tenant
de_de: Mieter
fr_fr: Locataire
ja_jp: テナント
pt_br: Locatário
sv_se: Hyresgäst
zh_cn: 租户

source: Test execution
de_de: Testausführung
fr_fr: Exécution de test
ja_jp: テスト実行
pt_br: Execução de teste
sv_se: Testutförande
zh_cn: 测试执行

source: Testing
de_de: Testen
fr_fr: Essai
ja_jp: テスト
pt_br: Teste
sv_se: Testning
zh_cn: 测试

source: Test resources
de_de: Testressourcen
fr_fr: Tester les ressources
ja_jp: テストリソース
pt_br: Recursos de teste
sv_se: Testresurser
zh_cn: 测试资源

source: Theme
de_de: Thema
fr_fr: Thème
ja_jp: テーマ
pt_br: Tema
sv_se: Tema
zh_cn: 主题

source: Tool bar
de_de: Werkzeugleiste
fr_fr: Barre d'outils
ja_jp: ツールバー
pt_br: Barra de ferramentas
sv_se: Verktygsfält
zh_cn: 工具栏

source: Year to date
de_de: Der bisherige Jahresverlauf
fr_fr: Année à ce jour
ja_jp: 年初来
pt_br: No acumulado do ano
sv_se: År hittills
zh_cn: 今年迄今为止
