Repository: jerkerolofsson/testbucket
Catalog: src/TestBucket/Localization/SettingStrings.*.resx
Languages: de_de, fr_fr, ja_jp, pt_br, sv_se, zh_cn

source: Accessibility
de_de: Zugänglichkeit
fr_fr: Accessibilité
ja_jp: アクセシビリティ
pt_br: Acessibilidade
sv_se: Tillgänglighet
zh_cn: 可访问性

source: Add MCP server
de_de: MCP Server hinzufügen
fr_fr: Ajouter le serveur MCP
ja_jp: MCPサーバーを追加します
pt_br: Adicione o servidor MCP
sv_se: Lägg till MCP -server
zh_cn: 添加MCP服务器

source: AI
fr_fr: IA
zh_cn: 人工智能

# ai-azure-provider-key
source: Azure production key
de_de: Azure -Produktionschlüssel
fr_fr: Clé de production Azure
ja_jp: Azure Productionキー
pt_br: Chave de produção do Azure
sv_se: Azure -produktionsnyckel
zh_cn: Azure生产密钥

# ai-default-model
source: Default AI model
de_de: Standard -AI -Modell
fr_fr: Modèle AI par défaut
ja_jp: デフォルトAIモデル
pt_br: Modelo AI padrão
sv_se: Standard AI -modell
zh_cn: 默认AI模型

# ai-default-model-price-per-1M-tokens
source: Cost for 1M input tokens
de_de: Kosten für 1 -m -Eingangs -Token
fr_fr: Coût pour les jetons de 1 m
ja_jp: 1Mの入力トークンのコスト
pt_br: Custo para 1m tokens
sv_se: Kostnad för 1M ingångstokens
zh_cn: 1M输入令牌的成本

# ai-default-model-price-per-1M-tokens-description
source: Billing cost for 1 million tokens in USD. This is only used to estimate and visualize costs for internal reports and will not affect any actual billing.
de_de: Abrechnungskosten für 1 Million Token in USD. Dies wird nur verwendet, um die Kosten für interne Berichte abzuschätzen und zu visualisieren, und wirkt sich nicht auf eine tatsächliche Abrechnung aus.
fr_fr: Le coût de facturation pour 1 million de jetons en USD. Ceci est uniquement utilisé pour estimer et visualiser les coûts des rapports internes et n'affectera aucune facturation réelle.
ja_jp: 100万米ドルのトークンの請求費用。これは、内部レポートのコストを推定および視覚化するためにのみ使用され、実際の請求には影響しません。
pt_br: Custo de cobrança para 1 milhão de tokens em USD. Isso é usado apenas para estimar e visualizar custos para relatórios internos e não afetará nenhuma cobrança real.
sv_se: Faktureringskostnad för 1 miljon tokens i USD. Detta används endast för att uppskatta och visualisera kostnader för interna rapporter och kommer inte att påverka någon faktisk fakturering.
zh_cn: 100万个令牌的计费成本。 这仅用于估计和可视化内部报告的成本，不会影响任何实际的计费。

# ai-default-model-price-per-1M-tokens-output
source: Cost for 1M output tokens
de_de: Kosten für 1 -m -Ausgangs -Token
ja_jp: 1mの出力トークンのコスト
sv_se: Kostnad för 1M utgångstokens
zh_cn: 1m输出令牌的成本

# ai-embedding-model
source: Embedding model
de_de: Einbettungsmodell
fr_fr: Modèle d'incorporation
ja_jp: 埋め込みモデル
pt_br: Modelo de incorporação
sv_se: Inbäddningsmodell
zh_cn: 嵌入模型

# ai-github-pat
source: Github Models Personal Access Token (PAT)
de_de: GitHub -Modelle Personal Access Token (PAT)
fr_fr: Modèles GitHub Token d'accès personnel (PAT)
ja_jp: githubモデルパーソナルアクセストークン（pat）
pt_br: Modelos do Github Token de acesso pessoal (PAT)
sv_se: Github modellerar personlig åtkomsttoken (PAT)
zh_cn: GitHub模型个人访问令牌（PAT）

# ai-models
source: Models
de_de: Modelle
fr_fr: Modèles
ja_jp: モデル
pt_br: Modelos
sv_se: Modeller
zh_cn: 型号

source: AI provider
de_de: KI -Anbieter
fr_fr: Fournisseur d'IA
ja_jp: AIプロバイダー
pt_br: Provedor de IA
sv_se: AI -leverantör
zh_cn: AI提供商

# ai-provider-description
source: The AI provider to use for this tenant
de_de: Der KI -Anbieter, der für diesen Mieter verwendet wird
fr_fr: Le fournisseur d'IA à utiliser pour ce locataire
ja_jp: このテナントに使用するAIプロバイダー
pt_br: O provedor de IA para usar para este inquilino
sv_se: AI -leverantören att använda för denna hyresgäst
zh_cn: 该租户使用的AI提供商

source: AI runner
de_de: KI -Läufer
fr_fr: Runner AI
ja_jp: AIランナー
pt_br: AI corredor
zh_cn: AI跑步者

# ai-runner-enabled
source: Use AI runner
de_de: Verwenden Sie den AI -Läufer
fr_fr: Utiliser AI Runner
ja_jp: AIランナーを使用します
pt_br: Use a IA Runner
sv_se: Använd AI Runner
zh_cn: 使用AI跑步者

# ai-runner-enabled-description
source: Enables the usage of the AI runner for this project
de_de: Ermöglicht die Verwendung des KI -Läufers für dieses Projekt
fr_fr: Permet l'utilisation du coureur d'IA pour ce projet
ja_jp: このプロジェクトのAIランナーの使用を可能にします
pt_br: Ativa o uso do corredor da IA para este projeto
sv_se: Möjliggör användning av AI -löparen för detta projekt
zh_cn: 启用该项目的AI跑步者的用法

source: AI Runner max. tokens per day
de_de: KI Runner Max. Token pro Tag
fr_fr: AI Runner Max. Tokens par jour
ja_jp: AIランナーマックス。 1日あたりのトークン
pt_br: AI Runner Max. Tokens por dia
sv_se: AI Runner Max. tokens per dag
zh_cn: AI Runner Max。 令牌每天

# ai-runner-max-tokens-per-day-description
source: Maximum number of tokens that can be consumed in a day by the AI runner
de_de: Maximale Anzahl von Token, die vom KI -Läufer an einem Tag konsumiert werden können
fr_fr: Nombre maximum de jetons qui peuvent être consommés en une journée par le coureur d'IA
ja_jp: AIランナーが1日で消費できるトークンの最大数
pt_br: Número máximo de tokens que podem ser consumidos em um dia pelo corredor da IA
sv_se: Maximalt antal tokens som kan konsumeras på en dag av AI -löparen
zh_cn: AI跑步者一天可以消耗的最大代币数量

source: AI usage
de_de: KI -Verwendung
fr_fr: Utilisation de l'IA
ja_jp: AIの使用
pt_br: Uso da IA
sv_se: AI -användning
zh_cn: AI的用法

source: Appearance
de_de: Aussehen
fr_fr: Apparence
ja_jp: 外観
pt_br: Aparência
sv_se: Utseende
zh_cn: 外貌

# archive-test-runs-automatically-age
source: Archive test runs after
de_de: Archivtest läuft danach
fr_fr: Les tests d'archives fonctionnent après
ja_jp: アーカイブテストはその後実行されます
pt_br: O teste de arquivo é executado depois
sv_se: Arkivtest körs efter
zh_cn: 档案测试在此之后进行

# archive-test-runs-automatically-age-description
source: Closed test runs will be archived after this time period
de_de: Nach diesem Zeitraum werden geschlossene Testläufe archiviert
fr_fr: Les essais fermés seront archivés après cette période
ja_jp: クローズドテストの実行は、この期間の後にアーカイブされます
pt_br: As execuções de teste fechadas serão arquivadas após esse período
sv_se: Stängda testkörningar arkiveras efter denna tidsperiod
zh_cn: 封闭的测试运行将在此时间段之后存档

# archive-test-runs-automatically-enabled
source: Archive test runs
de_de: Archivtest läuft
fr_fr: Test d'archives exécutives
ja_jp: アーカイブテストが実行されます
pt_br: Teste de arquivo é executado
sv_se: Arkivtestkörningar
zh_cn: 存档测试运行

# archive-test-runs-automatically-enabled-description
source: If enabled, closed test runs older than the configured limit will be archived automatically
de_de: Wenn es aktiviert ist, wird geschlossener Testläufe älter als das konfigurierte Grenzwert werden automatisch archiviert
fr_fr: S'il est activé, le test fermé s'exécute plus ancien que la limite configurée sera archivée automatiquement
ja_jp: 有効にすると、構成された制限が自動的にアーカイブされるよりも古いテスト実行が実行されます
pt_br: Se ativado, o teste fechado é mais antigo que o limite configurado será arquivado automaticamente
sv_se: Om det är aktiverat, kommer det stängda testet äldre än den konfigurerade gränsen att arkiveras automatiskt
zh_cn: 如果启用，关闭的测试运行比配置的限制将自动存档

source: Archiving
de_de: Archivierung
fr_fr: Archivage
ja_jp: アーカイブ
pt_br: Arquivamento
sv_se: Arkivering
zh_cn: 存档

# auto-approve-tests
source: Automatically approve tests
de_de: Automatisch Tests genehmigen
fr_fr: Approuver automatiquement les tests
ja_jp: テストを自動的に承認します
pt_br: Aprovar automaticamente os testes
sv_se: Godkänna automatiskt tester
zh_cn: 自动批准测试

# auto-approve-tests-description
source: Approves tests when all reviewers have voted postive
de_de: Genehmigte Tests, wenn alle Gutachter positiv gestimmt haben
fr_fr: Tests approuvés lorsque tous les examinateurs ont voté positif
ja_jp: すべてのレビュアーがポジティブに投票した場合、承認されたテスト
pt_br: Testes aprovados quando todos os revisores votaram positivos
sv_se: Godkända tester när alla granskare har röstat positiva
zh_cn: 所有审阅者都投票肯定的批准测试

source: Backup
fr_fr: Sauvegarde
ja_jp: バックアップ
sv_se: Säkerhetskopiering
zh_cn: 备份

# block-edit-in-review-state
source: Block edit when state is "Review"
de_de: Block bearbeiten, wenn der Status "Review" ist
fr_fr: Bloquer l'édition lorsque l'état est "revue"
ja_jp: 状態が「レビュー」であるときにブロック編集
pt_br: Bloco Editar quando o estado é "revisão"
sv_se: Blockera redigera när tillståndet är "recension"
zh_cn: 当状态为“评论”时块编辑

source: Change state to completed when approved
de_de: Ändern Sie den Staat auf Fertigstellung bei der Genehmigung
fr_fr: Changer d'état à terminé lorsqu'il est approuvé
ja_jp: 承認されたときに状態を完了して完了します
pt_br: Altere o estado para concluído quando aprovado
sv_se: Ändra tillstånd till slutförd när den godkänns
zh_cn: 批准后将状态更改为完成

# change-state-to-completed-when-approved-description
source: Changes state to Completed when someone approves the test case. This requires the Approved field to be enabled and a Completed state to be defined for tests.
de_de: Änderungen an den Zustand, wenn jemand den Testfall genehmigt. Dadurch muss das zugelassene Feld aktiviert und ein abgeschlossener Zustand für Tests definiert werden.
fr_fr: Modifie l'état à terminé lorsque quelqu'un approuve le cas de test. Cela nécessite que le champ approuvé soit activé et qu'un état terminé soit défini pour les tests.
ja_jp: 誰かがテストケースを承認したときに状態を変更して完了します。これには、承認されたフィールドを有効にする必要があり、完了した状態をテスト用に定義する必要があります。
pt_br: As alterações afirmam concluir quando alguém aprova o caso de teste. Isso exige que o campo aprovado seja ativado e um estado concluído a ser definido para testes.
sv_se: Ändrar tillstånd till slutförd när någon godkänner testfallet. Detta kräver att det godkända fältet ska aktiveras och ett slutfört tillstånd definieras för tester.
zh_cn: 当有人批准测试案例时，将状态更改为完成。 这要求启用批准的字段，并为测试定义一个完整的状态。

# change-state-to-ongoing-when-editing-tests
source: Change state to ongoing when editing a completed test
de_de: Wechseln Sie den Zustand in der laufenden Bearbeitung eines abgeschlossenen Tests
fr_fr: Changer l'état en cours lors de la modification d'un test terminé
ja_jp: 完了したテストを編集するときに、状態を継続的に変更します
pt_br: Alterar o estado para contínuo ao editar um teste preenchido
sv_se: Ändra tillstånd till pågående när du redigerar ett slutfört test
zh_cn: 编辑完成的测试时，将状态更改为正在进行的

# change-state-to-ongoing-when-editing-tests-description
source: This changes the state to ongoing if the description is changed while in the completed state.
de_de: Dies ändert den Staat in laufend, wenn die Beschreibung im vollständigen Zustand geändert wird.
fr_fr: Cela modifie l'état en continu si la description est modifiée dans l'état terminé.
ja_jp: これにより、完了した状態で説明が変更された場合、状態は継続的に変更されます。
pt_br: Isso altera o estado em andamento se a descrição for alterada enquanto estiver no estado concluído.
sv_se: Detta ändrar staten till pågående om beskrivningen ändras i det färdiga tillståndet.
zh_cn: 如果在完整状态时更改了描述，则将状态更改为正在进行的状态。

source: Color
de_de: Farbe
fr_fr: Couleur
ja_jp: 色
pt_br: Cor
sv_se: Färg
zh_cn: 颜色

source: Colors
de_de: Farben
fr_fr: Couleurs
ja_jp: 色
pt_br: Cores
sv_se: Färger
zh_cn: 颜色

source: Commands
de_de: Befehle
fr_fr: Commandes
ja_jp: コマンド
pt_br: Comandos
sv_se: Kommandon
zh_cn: 命令

source: Dark mode
de_de: Dunkler Modus
fr_fr: Mode sombre
ja_jp: ダークモード
pt_br: Modo escuro
sv_se: Mörkt läge
zh_cn: 黑暗模式

source: Defaults
de_de: Standardeinstellungen
fr_fr: Par défaut
ja_jp: デフォルト
pt_br: Padrões
sv_se: Standard
zh_cn: 默认值

source: Default tenant
de_de: Standardmieter
fr_fr: Locataire par défaut
ja_jp: デフォルトのテナント
pt_br: Inquilino padrão
sv_se: Standardhyresgäst
zh_cn: 默认租户

# default-tenant-description
source: The default tenant is used as the default redirect if a user accesses TestBucket without specifying a tenant.
de_de: Der Standardmieter wird als Standard -Umleitung verwendet, wenn ein Benutzer auf TestBucket zugreift, ohne einen Mieter anzugeben.
fr_fr: Le locataire par défaut est utilisé comme redirection par défaut si un utilisateur accède à TestBucket sans spécifier un locataire.
ja_jp: デフォルトのテナントは、テナントを指定せずにユーザーがTestBucketにアクセスする場合、デフォルトのリダイレクトとして使用されます。
pt_br: O inquilino padrão é usado como redirecionamento padrão se um usuário acessar o TestBucket sem especificar um inquilino.
sv_se: Standardhyresgästen används som standarddirigering om en användare kommer åt testbucket utan att ange en hyresgäst.
zh_cn: 如果用户在没有指定租户的情况下访问testbucket，则将默认租户用作默认重定向。

source: Delete resource if not seen for
de_de: Ressource löschen, wenn nicht zu sehen ist
fr_fr: Supprimer la ressource si elle n'est pas vue pour
ja_jp: 見られない場合はリソースを削除します
pt_br: Excluir recursos se não for visto para
sv_se: Ta bort resursen om den inte ses för
zh_cn: 删除资源如果看不到

source: Editor
fr_fr: Éditeur
ja_jp: エディタ
sv_se: Redaktör
zh_cn: 编辑

# embedding-ai-provider
source: AI provider for embeddings
de_de: KI -Anbieter für Einbettungen
fr_fr: Fournisseur d'IA pour les intégres
ja_jp: 埋め込みのAIプロバイダー
pt_br: Provedor de IA para incorporação
sv_se: AI -leverantör för inbäddningar
zh_cn: AI嵌入的AI提供商

source: Explorer dock
fr_fr: Quai d'explorateur
ja_jp: エクスプローラードック
pt_br: Dock Explorer
sv_se: Explorer
zh_cn: 资源管理器码头

# explorer-dock-description
source: Location of the explorer panel in thee user interface
de_de: Standort des Explorer -Panels in der Benutzeroberfläche
fr_fr: Emplacement du panneau Explorer dans l'interface utilisateur
ja_jp: ユーザーインターフェイスのエクスプローラーパネルの場所
pt_br: Localização do painel Explorer na interface do usuário
sv_se: Plats för Explorer -panelen i dig användargränssnitt
zh_cn: 资源管理器面板的位置在您的用户界面中

source: Increased contrast
de_de: Erhöhter Kontrast
fr_fr: Contraste accru
ja_jp: コントラストの増加
pt_br: Aumento do contraste
sv_se: Ökad kontrast
zh_cn: 对比度增加

# increased-contrast-description
source: Increases color contrast to make the user interface easier to navigate
de_de: Erhöht den Farbkontrast, um die Benutzeroberfläche einfacher zu navigieren erleichtern
fr_fr: Augmente le contraste des couleurs pour rendre l'interface utilisateur plus facile à naviguer
ja_jp: 色のコントラストを増やして、ユーザーインターフェイスをナビゲートしやすくする
pt_br: Aumenta o contraste de cores para facilitar a interface do usuário
sv_se: Ökar färgkontrasten för att göra användargränssnittet lättare att navigera
zh_cn: 增加颜色对比度使用户界面更易于导航

source: Increased font size
de_de: Erhöhte Schriftgröße
fr_fr: Augmentation de la taille de la police
ja_jp: フォントサイズの増加
pt_br: Aumento do tamanho da fonte
sv_se: Ökad teckensnittsstorlek
zh_cn: 字体尺寸增加

# increased-font-size-description
source: Increases the font size overriding theme settings
de_de: Erhöht die übergeordneten Themeneinstellungen der Schriftgröße
fr_fr: Augmente les paramètres de thème subordonnés de la taille de la police
ja_jp: テーマ設定をオーバーライドするフォントサイズを増やします
pt_br: Aumenta as configurações de tema que substitui o tamanho da fonte
sv_se: Ökar tematinställningarna för teckensnittsstorlek
zh_cn: 增加字体大小的主题设置

source: Keyboard
de_de: Tastatur
fr_fr: Clavier
ja_jp: キーボード
pt_br: Teclado
sv_se: Tangentbord
zh_cn: 键盘

# language-multilang
source: Language / Idioma / Langue / 语言 / 言語 / لغة / 언어
de_de: Sprache / Idiom / Langue / 语言 / 言語 / غة / 언어
fr_fr: Langue / idioma / langue / 语言 / 言語 / لغة / 언어
ja_jp: 言語 /イディオマ / langue /语言 /言語 /¹ /언어
pt_br: Idioma / idioma / langue / 语言 / 言語 / لغة / 언어
sv_se: Språk / idiom / langue / 语言 / 言語 / لغة / 언어
zh_cn: 语言 /习语 / langue /语言 /言语 / /언어 /언어

source: Layout
fr_fr: Mise en page
ja_jp: レイアウト
zh_cn: 布局

source: Light mode
de_de: Lichtmodus
fr_fr: Mode léger
ja_jp: ライトモード
pt_br: Modo de luz
sv_se: Ljusläge
zh_cn: 光模式

source: Manage accounts
de_de: Konten verwalten
fr_fr: Gérer les comptes
ja_jp: アカウントを管理します
pt_br: Gerenciar contas
sv_se: Hantera konton
zh_cn: 管理帐户

source: Manage environments
de_de: Umgebungen verwalten
fr_fr: Gérer les environnements
ja_jp: 環境を管理します
pt_br: Gerenciar ambientes
sv_se: Hantera miljöer
zh_cn: 管理环境

source: Manage heuristics
de_de: Heuristiken verwalten
fr_fr: Gérer l'heuristique
ja_jp: ヒューリスティックを管理します
pt_br: Gerenciar heurísticas
sv_se: Hantera heuristik
zh_cn: 管理启发式方法

source: Manage labels
de_de: Etiketten verwalten
fr_fr: Gérer les étiquettes
ja_jp: ラベルを管理します
pt_br: Gerenciar rótulos
sv_se: Hantera etiketter
zh_cn: 管理标签

source: Manage milestones
de_de: Meilensteine verwalten
fr_fr: Gérer les jalons
ja_jp: マイルストーンを管理します
pt_br: Gerenciar marcos
sv_se: Hantera milstolpar
zh_cn: 管理里程碑

source: Manage projects
de_de: Projekte verwalten
fr_fr: Gérer les projets
ja_jp: プロジェクトを管理します
pt_br: Gerenciar projetos
sv_se: Hantera projekt
zh_cn: 管理项目

# manage-resources
source: Resources & devices
de_de: Ressourcen und Geräte
fr_fr: Ressources et appareils
ja_jp: リソースとデバイス
pt_br: Recursos e dispositivos
sv_se: Resurser och enheter
zh_cn: 资源和设备

source: Manage roles
de_de: Rollen verwalten
fr_fr: Gérer les rôles
ja_jp: 役割を管理します
pt_br: Gerenciar funções
sv_se: Hantera roller
zh_cn: 管理角色

source: Manage runners
de_de: Läufer verwalten
fr_fr: Gérer les coureurs
ja_jp: ランナーを管理します
pt_br: Gerenciar corredores
sv_se: Hantera löpare
zh_cn: 管理跑步者

source: Manage states
de_de: Staaten verwalten
fr_fr: Gérer les États
ja_jp: 状態を管理します
pt_br: Gerenciar estados
sv_se: Hantera stater
zh_cn: 管理国家

source: Manage teams
de_de: Teams verwalten
fr_fr: Gérer les équipes
ja_jp: チームを管理します
pt_br: Gerenciar equipes
sv_se: Hantera lag
zh_cn: 管理团队

source: Manage tenants
de_de: Mieter verwalten
fr_fr: Gérer les locataires
ja_jp: テナントを管理します
pt_br: Gerenciar inquilinos
sv_se: Hantera hyresgäster
zh_cn: 管理租户

source: Manage users
de_de: Benutzer verwalten
fr_fr: Gérer les utilisateurs
ja_jp: ユーザーを管理します
pt_br: Gerenciar usuários
sv_se: Hantera användare
zh_cn: 管理用户

# mcp-claude
source: Add the json above to "claude_desktop_config.json" to use TestBucket tools from Claude AI
de_de: Fügen Sie den JSON oben zu "Claude_Desktop_config.json" hinzu, um Test -Bucket -Tools von Claude AI zu verwenden
fr_fr: Ajoutez le JSON ci-dessus à "Claude_desktop_config.json" pour utiliser des outils TestBucket de Claude AI
ja_jp: 上記のjsonを「claude_desktop_config.json」に追加して、claude aiのテストバケットツールを使用します
pt_br: Adicione o json acima a "Claude_desktop_config.json" para usar ferramentas testbucket de Claude AI
sv_se: Lägg till JSON ovan till "CLAUDE_DESKTOP_CONFIG.JSON" för att använda TestBucket från Claude AI
zh_cn: 将上面的JSON添加到“ Claude_desktop_config.json”中，以使用Claude AI的TestBucket工具

source: MCP client configuration
de_de: MCP -Client -Konfiguration
fr_fr: Configuration du client MCP
ja_jp: MCPクライアント構成
pt_br: Configuração do cliente MCP
sv_se: MCP -klientkonfiguration
zh_cn: MCP客户端配置

# mcp-public
source: Available to all project members
de_de: Verfügbar für alle Projektmitglieder
fr_fr: Disponible pour tous les membres du projet
ja_jp: すべてのプロジェクトメンバーが利用できます
pt_br: Disponível para todos os membros do projeto
sv_se: Tillgänglig för alla projektmedlemmar
zh_cn: 所有项目成员可用

# mcp-public-description
source: A public MCP server may be used by any project member. If it is not public it is only available to a single user.
de_de: Ein öffentlicher MCP -Server kann von jedem Projektmitglied verwendet werden. Wenn es nicht öffentlich ist, steht es nur einem einzelnen Benutzer zur Verfügung.
fr_fr: Un serveur MCP public peut être utilisé par n'importe quel membre du projet. S'il n'est pas public, il n'est disponible que pour un seul utilisateur.
ja_jp: パブリックMCPサーバーは、プロジェクトメンバーが使用できます。公開されていない場合は、単一のユーザーのみが利用できます。
pt_br: Um servidor MCP público pode ser usado por qualquer membro do projeto. Se não for público, ele está disponível apenas para um único usuário.
sv_se: En offentlig MCP -server kan användas av alla projektmedlemmar. Om det inte är offentligt är det bara tillgängligt för en enda användare.
zh_cn: 任何项目成员都可以使用公共MCP服务器。 如果不是公共的，则仅适用于单个用户。

source: MCP server
fr_fr: Serveur MCP
ja_jp: MCPサーバー
pt_br: Servidor MCP
zh_cn: MCP服务器

source: MCP server integrations
de_de: MCP Server -Integrationen
fr_fr: Intégrations du serveur MCP
ja_jp: MCPサーバーの統合
pt_br: Integrações do servidor MCP
sv_se: MCP -serverintegrationer
zh_cn: MCP服务器集成

source: MCP server JSON
ja_jp: MCPサーバーJSON
zh_cn: MCP服务器JSON

# mcp-tool-name
source: MCP Tool
fr_fr: Outil MCP
ja_jp: MCPツール
pt_br: Ferramenta MCP
sv_se: MCP -verktyg
zh_cn: MCP工具

# mcp-visualstudio
source: Add the json above to ".vscode/mcp.json" to use TestBucket from Visual Studio
de_de: Fügen Sie den JSON oben hinzu zu ".vscode/mcp.json", um den Test -Bucket von Visual Studio zu verwenden
fr_fr: Ajoutez le JSON ci-dessus à ".vscode / mcp.json" pour utiliser TestBucket de Visual Studio
ja_jp: 上記のjsonを「.vscode/mcp.json」に追加して、Visual Studioのテストバケットを使用します
pt_br: Adicione o JSON acima a ".vscode/mcp.json" para usar o testbucket do Visual Studio
sv_se: Lägg till JSON ovan till ".vscode/mcp.json" för att använda TestBucket från Visual Studio
zh_cn: 将上面的JSON添加到“ .VSCODE/MCP.JSON”中以使用Visual Studio中的TestBucket

# mcp-vscode
source: Add the json above to ".vscode/mcp.json" to use TestBucket from VS Code
de_de: Fügen Sie den JSON oben hinzu zu ".vscode/mcp.json", um den Test -Bucket aus VS -Code zu verwenden
fr_fr: Ajoutez le JSON ci-dessus à ".vscode / mcp.json" pour utiliser TestBucket à partir du code vs
ja_jp: 上記のjsonを「.vscode/mcp.json」に追加して、VSコードからテストバケットを使用します
pt_br: Adicione o json acima a ".vscode/mcp.json" para usar o testbucket do vs código
sv_se: Lägg till JSON ovan till ".vscode/MCP.JSON" för att använda TestBucket från VSCode
zh_cn: 将上面的JSON添加到“ .VSCODE/MCP.JSON”中以使用VS代码的TestBucket

# ollama-context-length-message
source: When using Ollama make sure to configure a context length suitable for the model used. You can configure the Ollama context size using the environment variable OLLAMA_CONTEXT_LENGTH for the Ollama docker container. For example OLLAMA_CONTEXT_LENGTH=131072 (128k) context length for Gemma3 or 40960 (40k) for Qwen3.
de_de: Stellen Sie bei der Verwendung von Ollama sicher, dass Sie eine für das verwendete Modell geeignete Kontextlänge konfigurieren. Sie können die Ollama -Kontextgröße mithilfe der Umgebungsvariablen olollama_Context_length für den OLLAMA Docker -Container konfigurieren. Zum Beispiel ilama_context_length = 131072 (128K) Kontextlänge für GEMMA3 oder 40960 (40K) für QWEN3.
fr_fr: Lorsque vous utilisez Olllama, assurez-vous de configurer une longueur de contexte adaptée au modèle utilisé. Vous pouvez configurer la taille du contexte Olllama à l'aide de la variable d'environnement OLLAMA_CONTEXT_LENGTH pour le conteneur Docker Olllama. Par exemple, ollama_context_length = 131072 (128k) Longueur de contexte pour GEMMA3 ou 40960 (40K) pour qwen3.
ja_jp: Ollamaを使用する場合、使用するモデルに適したコンテキスト長を確実に構成してください。 Ollama Dockerコンテナの環境変数ollama_context_lengthを使用して、Ollamaコンテキストサイズを構成できます。たとえば、ollama_context_length = 131072（128k）gemma3のコンテキスト長またはqwen3の40960（40k）。
pt_br: Ao usar o ollama, configure um comprimento de contexto adequado para o modelo usado. Você pode configurar o tamanho do contexto ollama usando a variável de ambiente ollama_context_length para o contêiner Ollama Docker. Por exemplo, ollama_context_length = 131072 (128K) Comprimento do contexto para gemma3 ou 40960 (40K) para QWEN3.
sv_se: När du använder Ollama måste du konfigurera en kontextlängd som är lämplig för den använda modellen. Du kan konfigurera Ollama -kontextstorleken med hjälp av miljövariabeln Ollama_Context_Length för Ollama Docker -behållaren. Till exempel ollama_Context_Length = 131072 (128K) Kontextlängd för GEMMA3 eller 40960 (40K) för QWEN3.
zh_cn: 使用Ollama时，请确保配置适合使用的模型的上下文长度。 您可以使用环境变量Ollama_context_length为Ollama Docker容器配置Ollama上下文大小。 例如，ollama_context_length = 131072（128K）gemma3或40960（40k）的上下文长度（40k）qwen3。

# openai-provider-key
source: OpenAI API key
de_de: OpenAI -API -Schlüssel
fr_fr: Clé API Openai
ja_jp: Openai APIキー
pt_br: Chave da API OpenAI
sv_se: OpenAI API -nyckel
zh_cn: OpenAI API键

source: OpenAI settings
de_de: OpenAI -Einstellungen
fr_fr: Paramètres OpenAI
ja_jp: Openai設定
pt_br: Configurações do OpenAI
sv_se: Openai -inställningar
zh_cn: Openai设置

# prefer-text-to-icons
source: Prefer text instead of icons
de_de: Text anstelle von Symbolen vorbieten
fr_fr: Préfère le texte au lieu des icônes
ja_jp: アイコンの代わりにプレイテキスト
pt_br: Texto pref em vez de ícones
sv_se: Preftext istället för ikoner
zh_cn: PREF文字而不是图标
