Repository: jerkerolofsson/testbucket
Catalog: src/TestBucket/Localization/SharedStrings.*.resx
Languages: sv_se

source: Name
sv_se: Namn

source: Description
sv_se: Beskrivning

source: Project
sv_se: Projekt

source: Settings
sv_se: Inställningar

source: Projects
sv_se: Projekt

source: Variables
sv_se: Variabler

source: Test environment
sv_se: Testmiljö

source: Test environments
sv_se: Testmiljöer

source: Attachments
sv_se: Bilagor

source: Message
sv_se: Meddelande

# test-result
source: Result
sv_se: Testresultat

# result-passed
source: Passed
sv_se: Passerat

# result-norun
source: Not Executed
sv_se: Inte Testat

# result-blocked
source: Blocked
sv_se: Blockerat

# result-skipped
source: Skipped
sv_se: Skippat

# result-failed
source: Failed
sv_se: Falerat

source: Unassigned
sv_se: Icke Allokerade

source: Assigned to me
sv_se: Mina

# run-test-again
source: Run again
sv_se: Testa en gång till

source: Assigned to
sv_se: Allockerat till

source: Expiry
sv_se: Utgångsdatum

# confirm-delete-title
source: Delete item?
sv_se: Ta bort?

# confirm-delete-message
source: Do you really want to delete this item?
sv_se: Vill du verkligen ta bort denna saken?

source: API Keys
sv_se: API Nycklar

source: API Key
sv_se: API Nyckel

# test-case-variables-description
source: Test case variables contain parameters that override environment variables and can be used with templates to customize templates. A test parameter name is unique and there can only be one with the specific name. Data-driven test cases can have multiple configuration sets and a test case is executed once for each data-row. Variables are defined in a test case as {{Key}} and when running a test case the {{Key}} will be replaced by a variable named {{Key}}.
sv_se: Test variabler är värden som ersätter placeholders i testfallet som {{Name}} med värdet definerat i i tabellen. Om en testmiljö används så kan värdet från testmiljön användas, men om variablen finns definerad i båda så används värdet från testfallet.

# variable-key
source: Name
sv_se: Namn

# variable-value
source: Value
sv_se: Innehåll

source: Requirement coverage
sv_se: Kravtäckning

source: Users
sv_se: Användare

# permission-none
source: None
sv_se: Inga

# permission-read
source: Read-Only
sv_se: Läsa

# permission-write
source: Write
sv_se: Editera/Skapa

# permission-delete
source: Delete
sv_se: Ta bort

# role-site-admin
source: Site Administrator
sv_se: Sajt administratör

# role-tenant-admin
source: Administrator
sv_se: Administratör

# role-regular-user
source: Regular User
sv_se: Vanlig användare

# missing-permission-general
source: You don't have the necessary permissions to view this content
sv_se: Du saknar rättigheter för denna resurs

# test-suite-variables-description
source: These variables are added to tests executed from this test suite
sv_se: Dessa variabler kommer att användas för testfall som körs från denna testsvit

source: Automation
sv_se: Automatisering

source: Test accounts
sv_se: Testkonton

source: Test resources
sv_se: Testresurser

source: Model
sv_se: Modell

source: Roles
sv_se: Roller

source: Field
sv_se: Fält

source: Fields
sv_se: Fält

source: Requirements
sv_se: Krav

source: Add to run
sv_se: Lägg till körning

source: Run
sv_se: Körning

source: Duration
sv_se: Varaktighet

source: Modified
sv_se: Ändrad

source: Manufacturer
sv_se: Tillverkare

# result-inconclusive
source: Inconclusive
sv_se: Odefinierat

source: Delete
sv_se: Ta bort

# groupby-category
source: Category
sv_se: Kategori

source: Filter tests
sv_se: Filtrera testfall

source: Search tests
sv_se: Sök testfall

source: Created
sv_se: Skapad

source: Start date
sv_se: Start Datum

source: End date
sv_se: Slut datum

source: Link issue
sv_se: Länka en issue

# file-name
source: Name
sv_se: Namn

# file-size
source: Length
sv_se: Längd

# file-type
source: Type
sv_se: Filtyp

# no-permission-title
source: No permission!
sv_se: Inget tillstång

# no-permission-message
source: You don't have permission to perform this action. Contact the administrator if you require permission for this.
sv_se: Du saknar tillstånd för att utföra denna operation. Kontakta en administratör

source: Required resources
sv_se: Obligatoriska resurser

source: Teams
sv_se: Team

source: Test suites
sv_se: Testsviter

source: Test cases
sv_se: Testfall

source: Recent
sv_se: Nya

source: User
sv_se: Användare

# batch-tag
source: Batch update..
sv_se: Updatera flera..

source: Traceability
sv_se: Spårbarhet

# requirement-coverage--drop-requirements-helpertext
source: Drop requirements here to create a link between tests and the requirement
sv_se: Släpp krav här för att länka med ett testfall

source: Link requirement to test
sv_se: Länka krav till test

# number-of-tests
source: Tests
sv_se: Tester

source: Requirement
sv_se: Krav

# new-folder
source: Add folder
sv_se: Lägg till en folder

source: Test coverage
sv_se: Testtäckning

source: Icon
sv_se: Ikon

source: Icons
sv_se: Ikoner

source: Option
sv_se: Alternativ

source: Data source
sv_se: Datakälla

source: Options
sv_se: Alternativ

source: Advanced
sv_se: Avancerat

source: Preview
sv_se: Förhandsgranskning

# copied-to-clipboard-notification
source: Copied to clipboard
sv_se: Kopierat

source: Rename
sv_se: Döp om

# create-test-run
source: Create run
sv_se: Skapa körning

# edit-test-run
source: Edit run
sv_se: Editer körning

# pick-test-run
source: Pick run
sv_se: Välj

# duplicate-test-run
source: Duplicate run
sv_se: Duplicera körning

# delete-test-run
source: Delete run
sv_se: Ta bort körning

source: New test
sv_se: Nytt testfall

source: New shared steps
sv_se: Ny delade teststeg

# permission-approve
source: Approve
sv_se: Godkänn

# permission-execute
source: Execute
sv_se: Exekvera

source: Milestones
sv_se: Milstolpar

source: Calendar
sv_se: Kalender

source: Manage
sv_se: Hantera

source: Launch automation
sv_se: Start automatisering

source: Test automation
sv_se: Testautomatisering

source: Coverage Matrix
sv_se: Täckningsmatris

source: Column
sv_se: Kolumn

source: Row
sv_se: Rad

source: External ID
sv_se: Externt ID

source: Test runs
sv_se: Testkörningar

source: My Backlog
sv_se: Min backlog

source: Failures
sv_se: Fel

source: Tests
sv_se: Testfall

source: Add comment
sv_se: Lägg till kommentar

# logged-action-approved
source: {0} approved this
sv_se: {0} godkände

# logged-action-statechange
source: {0} changed state to {1}
sv_se: {0} ändrade status till {1}

source: Delete test
sv_se: Ta bort testfall

source: Delete run
sv_se: Ta bort körning

source: Duplicate test
sv_se: Duplicera testfall

source: Delete test suite
sv_se: Ta bort testsvit

source: New test suite
sv_se: Ny testsvit

# batch-tag-description
source: Link a requirement, or change a field for all descendants.
sv_se: Länka ett krav eller ändra ett fält för alla ättlingar

source: Import test results..
sv_se: Importera testresultat..

source: Run folder
sv_se: Kör folder

source: Edit folder
sv_se: Editera folder

source: Delete folder
sv_se: Ta bort folder

source: Enabled
sv_se: Aktiverad

source: Testing
sv_se: Testning

source: Reporting
sv_se: Rapportering

# logged-action-commit
source: {0} referenced a commit: {1}
sv_se: {0} länkade en commit {1}

# logged-action-assignedto
source: {0} assigned this to {1}
sv_se: {0} tilldelade denna till {1}

source: Type
sv_se: Typ

source: Label
sv_se: Etikett

source: Code
sv_se: Kod

source: Test results
sv_se: Testresultat

source: All
sv_se: Alla

source: Issue
sv_se: Bugg

source: Title
sv_se: Titel

# logged-action-component
source: {0} changed component to {1}
sv_se: {0} la till {1}

# logged-action-component-removed
source: {0} removed the component
sv_se: {0} tog bort komponenten

source: Run test suite
sv_se: Kör testsvit

source: E2E tests
sv_se: E2E-tester

source: Integration tests
sv_se: Integrationstest

source: Unit tests
sv_se: Enhetstest

source: API tests
sv_se: API test

source: Features
sv_se: Funktioner

source: Components
sv_se: Komponenter

# automation-default-ci-cd-ref-description
source: Select the default branch / reference
sv_se: Välj default branch eller referens

# required-resources-description
source: Required resources that will be allocated and assigned to the test run when running automation tests.
sv_se: Resurser som kommer att allokeras till testkörningar

source: Resource type
sv_se: Resurstyp

source: Add resource
sv_se: Lägg till resurs

source: Add account
sv_se: Lägg till konto

# automation-ci-cd-add-outside-pipelines
source: Index CI/CD for results
sv_se: Indexera testresultat från CI/CD

source: CI/CD jobs
sv_se: CI/CDjobb

source: CI/CD job
sv_se: CI/CD jobb

source: New test template
sv_se: Ny testmall

source: Add
sv_se: Lägg till

# new-test-suite-description
source: Create a new blank test suite to store test cases
sv_se: Skapa en tom testsvit

# new-test-description
source: Create a new test case
sv_se: Skapa nytt testfall

# new-test-template-description
source: Create a shared template for test cases where the text is shared by all test cases using the template
sv_se: Skapa en ny mall för testfall

# logged-action-add-milestone
source: {0} added a milestone: {1}
sv_se: {0} länkade en milstolpe: {1}

# logged-action-remove-milestone
source: {0} removed a milestone: {1}
sv_se: {0} tog bort milstolpen: {1}

# logged-action-remove-component
source: {0} removed the component {1}
sv_se: {0} tog bort komponenten:{1}

# logged-action-add-component
source: {0} added a component: {1}
sv_se: {0} länkade en komponent: {1}

source: Search
sv_se: Sök

source: Overview
sv_se: Översikt

source: Edit
sv_se: Editera

source: Test log
sv_se: Testlogg

source: Capture screenshot on this device
sv_se: Fånga en skärmdump från denna enheten

source: Account
sv_se: Konto

# state-open
source: Open
sv_se: Öppen

# state-closed
source: Closed
sv_se: Stängd

# delete-test-run-description
source: Deletes the test run and all results
sv_se: Ta bort körningen och alla testresultat

source: Assigning tests..
sv_se: Tilldelar tester..

source: Assign all unassigned to me..
sv_se: Tilldela alla otilldelade till mig

# assign-all-unassigned-to-me-description
source: Assigns all currently unassigned tests to the current user
sv_se: Tilldelar alla otilldelade till dig

source: Latest test results
sv_se: Senaste testresultat

source: Username
sv_se: Användarnamn

source: Access failed count
sv_se: Antal misslyckade inloggningar

source: Locked
sv_se: Låst

source: Set light mode
sv_se: Ändra till ljust färgtema

source: Set dark mode
sv_se: Ändra till mörkt färgtema

source: Open
sv_se: Öppen

source: Labels
sv_se: Etiketter

# menu-new-description
source: Add new items
sv_se: Lägg till nya objekt

source: Open command palette
sv_se: Öppna kommandopalett

source: General
sv_se: Allmänt

source: Metrics
sv_se: Mätvärden

source: Add metric
sv_se: Lägg till mätvärde

# welcome-message
source: Welcome to Test Bucket
sv_se: Välkommen till Test Bucket

# welcome-add-project-title
source: Add a new project
sv_se: Lägg till ett nytt projekt

# welcome-add-project-message
source: Add a project before adding tests, issues, requirements or other entities.
sv_se: Lägg till ett projekt innan du lägger till tester, problem, krav eller andra enheter.

source: Add new project
sv_se: Lägg till nytt projekt

source: Add new team
sv_se: Lägg till nytt team

# max-file-size
source: Maximum file size: {0}
sv_se: Maximal filstorlek: {0}

source: Import test cases
sv_se: Importera testfall

source: value
sv_se: värde

source: Unit
sv_se: Enhet

# meter-name
source: Meter
sv_se: Mätare

# run-n-tests
source: Run {0} tests
sv_se: Kör {0} tester

source: Add heuristic
sv_se: Lägg till heuristik

source: History
sv_se: Historik

source: Main
sv_se: Huvud

source: Run test
sv_se: Kör test

source: Go to test case
sv_se: Gå till testfall

# go-to-testcase-description
source: Open the test case view
sv_se: Öppna testfallsvisningen

# no-variables-alert
source: There are no variables added
sv_se: Inga variabler har lagts till

source: Pre-conditions
sv_se: Förutsättningar

source: Post-conditions
sv_se: Efterförutsättningar

source: Add variable
sv_se: Lägg till variabel

# test-case-runs
source: Test results
sv_se: Testresultat

source: Recent test runs
sv_se: Senaste testkörningar

source: Go to run
sv_se: Gå till körning

source: Number of test case runs
sv_se: Antal testkörningar

source: Number of test cases
sv_se: Antal testfall

source: Failed tests
sv_se: Misslyckade tester

source: Passed
sv_se: Godkänd

source: Failed
sv_se: Misslyckad

source: New exploratory test charter
sv_se: Ny utforskande testcharter

# new-exploratory-test-charter-description
source: Creates a pre-defined charter for exploratory testing
sv_se: Skapar en fördefinierad charter för utforskande tester

source: Session duration
sv_se: Sessionsvaraktighet

source: Session log
sv_se: Sessionslogg

# delete-test-suite-folder-description
source: Deletes the test suite folder, all child folders and all test cases within those folders
sv_se: Tar bort testsvitmappen, alla undermappar och alla testfall inom dessa mappar

# api-keys-description
source: Access tokens and API keys
sv_se: Åtkomsttoken och API-nycklar

source: Requirements and Work Items
sv_se: Krav och arbetsobjekt

source: More options
sv_se: Fler alternativ

source: Testcase
sv_se: Testfall

source: Coverage
sv_se: Täckning

# upload-file-hint
source: Drag and drop files here or click to select a file
sv_se: Dra och släpp filer här eller klicka för att välja en fil

# upload-max-filesize-fmt
source: Max file size: {0}
sv_se: Maximal filstorlek: {0}

source: Browse
sv_se: Bläddra

source: Board
sv_se: Bräda

source: Timeline
sv_se: Tidslinje

# welcome-add-team-title
source: Add a team
sv_se: Lägg till ett team

# welcome-add-team-message
source: Get started by adding a team
sv_se: Kom igång genom att lägga till ett team

source: Dashboard
sv_se: Instrumentpanel
